app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."ownername" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["ownername", "Charles Devigne"]]
---
  def create
  	@user = User.where(ownername: params[:ownername]).first